<?php
	include("../../config/config.php");
?>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<?php
	 
	echo "<BR>";
	
	echo "ข้อความจากเอกสาร หน้าที่ 1 <BR>";
	echo "ประเภทสัญญาที่เลือก คือ ".$_POST['Type_Contract_Select_Input'].'<BR>';
	echo "เลขที่สัญญา คือ ".$_POST['Contract_ID'].'<BR>';
	echo "ตรวจสอบเอกสารครั้งที่ ".$_POST['Check_Time'].'<BR>';
	echo " A ใบส่งงาน-รับงานชองเจ้าหน้าที่ตรวจสอบ(checker)/เจ้าหน้าที่สินเชื่อ สถานะคือ ".$_POST['Check_A'].'<BR>';
	echo " B รายละเอียดพร้อมทั้งเอกสารรับกลับตามใบสั่งงาน สถานะคือ ".$_POST['Check_B'].'<BR>';
	echo " C การลงลายมือชื่อของเจ้าหน้าที่ Checker / เจ้าหน้าที่สินเชื่อ ที่รับ - ส่งงาน  สถานะคือ ".$_POST['Check_C'].'<BR>';
	echo " D หนังสือรับเงิน และ หนังสือสัญญาซื้อขาย / ใบเสร็จรับเงิน และ ใบกำกับภาษีค่าสินค้า สถานะคือ ".$_POST['Check_D'].'<BR>';
	echo " E หนังสือรับรองเช่าซื้อ <B>(เฉพาะทรัพย์สินที่เป็นยานพาหนะ)</B> สถานะคือ  ".$_POST['Check_E'].'<BR>';
 	echo " F หนังสือคำเตือนสำหรับผู้ค้ำประกัน<B>(เฉพาะทรัพย์สินที่เป็นรถจักรยานยนต์ กับรถยนต์)</B> สถานะคือ ".$_POST['Check_F'].'<BR>';
 	echo " G หนังสือข้อตกลงการรับประกันการซื้อคืนทรัพย์สินจากผู้จำหน่ายสินค้า<B>(อ้างอิงใบอนุมัติ/ข้อตกลงกับผู้จัดจำหน่าย)</B> ".$_POST['Check_G'].'<BR>';
	echo " H การลงลายมือชื่อ  ".$_POST['Check_H'].'<BR>';
	echo " I จำนวนลายมือชื่อที่ลงในสัญญาครบถ้วนทุกคนตามสัญญา ".$_POST['Check_I'].'<BR>';
	echo " J ลงลายมือชื่อในเอกสารครบทุกชุดตามที่บริษัทได้จัดทำขึ้น ".$_POST['Check_J'].'<BR>';
	echo " K การลงลายมือชื่อ ใช้ลายมือตรงกันทุกหน้าของสัญญา และตรงกับบัตรประชาชน / ทะเบียนรถยนต์/ทะเบียนเครื่องจักร".$_POST['Check_K'].'<BR>';
	echo " L การลงลายมือฃื่อประทับตรา ".$_POST['Check_L'].'<BR>';
	echo " M จำนวนลายมือชื่อที่ลงในสัญญาครบถ้วนทุกคนตามสัญญา ".$_POST['Check_M'].'<BR>';
	echo " N ลงลายมือชื่อในเอกสารครบทุกชุดตามที่บริษัทได้จัดทำขึ้น ".$_POST['Check_N'].'<BR>';
	echo " O การลงลายมือชื่อใช้ลายมือและตราประทับตรงกันทุกหน้าของสัญญาเทียบกับหนังสือรับรอง /ทะเบียนรถยนต์ /ทะเบียนเครื่องจักร ".$_POST['Check_O'].'<BR>';
	echo " P การลงลายมือชื่อ ".$_POST['Check_P'].'<BR>';
	echo " Q จำนวนลายมือชื่อที่ลงในสัญญาครบถ้วนทุกคนตามสัญญา ".$_POST['Check_Q'].'<BR>';
	echo " R ลงลายมือชื่อในเอกสารครบทุกชุดตามที่บริษัทได้จัดทำขึ้น ".$_POST['Check_R'].'<BR>';
	echo " S การลงลายมือชื่อ ใช้ลายมือตรงกันทุกหน้าของสัญญา และตรงกับบัตรประชาชน / ทะเบียนรถยนต์/ทะเบียนเครื่องจักร ".$_POST['Check_S'].'<BR>';
	echo " T การลงลายมือฃื่อประทับตรา ".$_POST['Check_T'].'<BR>';
	echo " U จำนวนลายมือชื่อที่ลงในสัญญาครบถ้วนทุกคนตามสัญญา ".$_POST['Check_U'].'<BR>';
	echo " V ลงสายมือชื่อในเอกสารครบทุกชุดตามที่บริษัทได้จัดทำขึ้น ".$_POST['Check_V'].'<BR>';
	echo " W การลงลายมือชื่อใช้ลายมือและตราประทับตรงกันทุกหน้าของสัญญาเทียบกับหนังสือรับรอง /ทะเบียนรถยนต์ /ทะเบียนเครื่องจักร".$_POST['Check_W'].'<BR>';
	echo " x ภาพถ่ายเปรียบเทียบกับ ใบส่งของ/ใบเสร็จรับเงิน/ใบกำกับภาษี ".$_POST['Check_X'].'<BR>';
	echo " Y ภาพถ่ายเปรียบเทียบกับ รายละเอียดทรัพย์สินในสัญญา ".$_POST['Check_Y'].'<BR>';
	echo "<BR>";
	echo "ข้อความจากเอกสาร หน้าที่ 2 "."<BR>";
	echo " Z สำเนาบัตรประชาชน /สำเนาหนังสือรับรองนิติบุคคล ".$_POST['Check_Z'].'<BR>';
	echo " @ สำเนาบัตรประชาชนที่ต้อง<u>ไม่หมดอายุ และเหลืออายุอีก 1 เดือน ณ วันทำสัญญา</u>/ สำเนาหนังสือรับรองนิติบุคคล<u>ไม่เกิน 1 เดือน</u> ".$_POST['Check_AA'].'<BR>';
	echo " # สำเนาบัตรประชาชนพร้อมลงชื่อรับรอง / สำเนาหนังสือรับรองนิติบุคคลพร้อมลงชื่อประทับตรา(ถ้ามี) ".$_POST['Check_AB']."<BR>";	
	echo " $ มีสำเนาบัตรประชาชนครบทุกคน / สำเนาหนังสือรับรองนิติบุคคลครบทุกนิติบุคคล ".$_POST['Check_AC'].'<BR>';
	echo " % เอกสารประกอบอื่น ๆ (ถ้ามี) ".$_POST['Check_AD'].'<BR>';
	echo " ก. การขีดคร่อมเอกสารที่ใช้ประกอบเป็นหลักฐานในการทำธุรกรรม ".$_POST['Check_AE'].'<BR>';
	echo " ข. วัตถุประสงค์ของการนำไปใช้ชัดเจน ตรงตามวัตถุประสงค์ของการกู้".$_POST['Check_AF'].'<BR>';
	echo " ค. หนังสือมอบอำนาจ ".$_POST['Check_AI'].'<BR>';
	echo " กรณีการมอบอำนาจให้กระทำการแทน ผู้ลงนามเป็นผู้รับมอบอำนาจ หรือไม่ ".$_POST['Check_AN'].'<BR>';
	echo " ง. อำนาจในการกระทำการแทนครอบคลุมถึงการลงนามในสัญญาหรือไม่ ".$_POST['Check_AJ'].'<BR>';
	echo " จ. สำเนาบัตรประชาชน/เอกสารอื่นพร้อมรับรองสำเนา (ผู้มอบอำนาจ) ".$_POST['Check_AK'].'<BR>';
	echo " ฉ. สำเนาบัตรประชาชน/เอกสารอื่นพร้อมรับรองสำเนา (ผู้รับมอบอำนาจ)".$_POST['Check_AL'].'<BR>';
	echo " ช. หนังสือมอบอำนาจยังมีผลบังคับใช้ได้หรือไม่ ".$_POST['Check_AM'].'<BR>';
	echo " ผู้ตรวจสอบ ".$_POST['Checker'].'<BR>';
	echo " ผลการตรวจสอบ ".$_POST['Check_Status'].'<BR>';
	echo " บันทึก ผู้ตรวจสอบ ".$_POST['Checker_Note'].'<BR>';
	
	echo " ลงฃื่อ ทนายผู้ให้คำรับรอง ชื่อ  ".$_POST['Legend'].'<BR>';
	
	
	echo "Now Input To Data Base ";
?>