<?php
set_time_limit (0); 
ini_set("memory_limit","128M"); 
include("config/config.php");

pg_query("BEGIN WORK");
$status = 0;
$sql_fa=mssql_query("select * from fill_Fn where N_state='0'");

while($res_fa = mssql_fetch_array($sql_fa)){
	$fa_cusid=trim($res_fa["CusID"]);	
	//นำ CusID ที่ได้ไปค้นหาให้ Fp เพื่อหา "IDNO"
	$query_fp=pg_query("SELECT * from \"Fp\" where \"CusID\"='$fa_cusid'");
	$numrowsfp=pg_num_rows($query_fp);

	if($numrowsfp!=0){ //ภ้าพบค่าใน Fp ให้ไปทำขั้นตอนต่อไป
		while($res_fp=pg_fetch_array($query_fp)){
			$IDNO=$res_fp["IDNO"];
			
			//นำ IDNO ที่ได้ไปค้นหาใน "Fp_Note" ว่ามีหรือไม่
			$query_fpnote=pg_query("SELECT * from \"Fp_Note\" where \"IDNO\"='$IDNO'");
			$numrows=pg_num_rows($query_fpnote);
			
			if($numrows==0){ //กรณีไม่พบว่ามีข้อมูลให้ add เข้าไปพร้อมกับ N_ContactAdd ที่ได้จากฐานเก่า
				//หา  N_ContactAdd จากฐานเก่า
				$sql_fn=mssql_query("SELECT *,convert(varchar,ISNULL(N_OT_DATE,''),111) AS OTDATE,
				ISNULL(N_SAN,'0')  AS N_SAN,
				ISNULL(N_AGE,'0')  AS N_AGE,
				ISNULL(N_CARD,'0')  AS N_CARD,
				ISNULL(N_IDCARD,'0')  AS N_IDCARD,
				ISNULL(N_BY,'0')  AS N_BY,
				ISNULL(N_OCC,'0')  AS N_OCC,
				ISNULL(N_ContactAdd,'0')  AS N_ContactAdd,
				N_STATE,IDNO
				from Fn  WHERE (IDNO='$IDNO') AND (N_STATE='0')");
				$res_fn=mssql_fetch_array($sql_fn);
				$i_contactadd=iconv('WINDOWS-874','UTF-8',$res_fn["N_ContactAdd"]);
				$cc_add=str_replace("'","-","$i_contactadd");
				$cc_add2=trim($cc_add);			
				if(($cc_add2 == "0") || ($cc_add2 == "ก") || ($cc_add2 == "--") || ($cc_add2 == "-") || 
				   ($cc_add2 == "") || ($cc_add2 =="ตำแหน่ง=  --&ทำงานที่บริษัท=  --&ที่อยู่บริษัท=  --") || ($cc_add2 =="ตำแหน่ง=&ทำงานที่บริษัท=&ที่อยู่บริษัท=") ||
				   ($cc_add2 == "ตำแหน่ง=--&ทำงานที่บริษัท=--&ที่อยู่บริษัท=--") || ($cc_add2 == "ตำแหน่ง= --&ทำงานที่บริษัท= --&ที่อยู่บริษัท= --") ||
				   ($cc_add2 =="ตำแหน่ง=---&ทำงานที่บริษัท=----&ที่อยู่บริษัท=----") || ($cc_add2=="ตำแหน่ง=  ---&ทำงานที่บริษัท=  ----&ที่อยู่บริษัท=  ----")||
				   ($cc_add2 =="ตำแหน่ง= ---&ทำงานที่บริษัท= ---&ที่อยู่บริษัท=  ----") || ($cc_add2=="ตำแหน่ง=  --&ทำงานที่บริษัท=  --&ที่อยู่บริษัท= --") ||
				   ($cc_add2 == "กา") || ($cc_add2=="ตำแหน่ง= -----&ทำงานที่บริษัท= ------&ที่อยู่บริษัท=    ------") || 
				   ($cc_add2 == "ตำแหน่ง= -----&ทำงานที่บริษัท= ------------&ที่อยู่บริษัท= ------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= -----&ทำงานที่บริษัท=-------------&ที่อยู่บริษัท= -----------------------") ||
				   ($cc_add2 == "ตำแหน่ง= -------&ทำงานที่บริษัท= -----------------&ที่อยู่บริษัท=---------------------------------------")||
				   ($cc_add2 == "ตำแหน่ง= -------&ทำงานที่บริษัท= --------------.&ที่อยู่บริษัท= -------------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= -------&ทำงานที่บริษัท= -----------------&ที่อยู่บริษัท= -------------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= -------&ทำงานที่บริษัท= ---------------&ที่อยู่บริษัท= -------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= --------&ทำงานที่บริษัท= --------------&ที่อยู่บริษัท= -------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= ------&ทำงานที่บริษัท= ----------&ที่อยู่บริษัท= -----------------------") ||
				   ($cc_add2 == "ตำแหน่ง= ------&ทำงานที่บริษัท= ------------&ที่อยู่บริษัท= -------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= ------&ทำงานที่บริษัท= -------------&ที่อยู่บริษัท= ------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= -----&ทำงานที่บริษัท= -----------&ที่อยู่บริษัท= -------------------------") ||
				   ($cc_add2 == "ตำแหน่ง= ------&ทำงานที่บริษัท= ----------&ที่อยู่บริษัท= -----------------------") ||
				   ($cc_add2 == "ตำแหน่ง=---&ทำงานที่บริษัท=---&ที่อยู่บริษัท=---") || ($cc_add2 == "ตำแหน่ง=---&ทำงานที่บริษัท=--&ที่อยู่บริษัท=--") ||
				   ($cc_add2 == "ตำแหน่ง=----&ทำงานที่บริษัท=-----&ที่อยู่บริษัท=---") || ($cc_add2 == "313")){				
				}else{	
					$ins="insert into \"Fp_Note\" (\"IDNO\",\"ContactNote\") values ('$IDNO','$cc_add')";
					if($res=pg_query($ins)){
					}else{
						$status++;
						echo $ins;
					}
				}
			}

		}//end while
	}
}

if($status == 0){
    pg_query("COMMIT");
    echo "<br>บันทึกข้อมูลเรียบร้อยแล้ว";
}else{
    pg_query("ROLLBACK");
    echo "ไม่สามารถบันทึกข้อมูลได้";
}
?>

