<?php
$type=array("รถยนต์นั่งส่วนบุคคลไม่เกิน 7 คน (รย.1)","รถยนต์นั่งส่วนบุคคลเกิน 7 คน (รย.2)","รถยนต์บรรทุกส่วนบุคคล (รย.3)",
"รถยนต์สามล้อส่วนบุคคล (รย.4)","รถยนต์รับจ้างระหว่างจังหวัด (รย.5)","รถยนต์รับจ้างบรรทุกคนโดยสารไม่เกิน 7 คน (รย.6)",
"รถยนต์สี่ล้อเล็กรับจ้าง (รย.7)","รถยนต์รับจ้างสามล้อ (รย.8)","รถยนต์บริการธุรกิจ (รย.9)",
"รถยนต์บริการทัศนาจร (รย.10)","รถยนต์บริการให้เช่า (รย.11)","รถจักรยานยนต์ (รย.12)",
"รถแทรคเตอร์ (รย.13)","รถบดถนน (รย.14)","รถใช้งานเกษตรกรรม (รย.15)",
"รถพ่วง (รย.16)","รถจักรยานยนต์สาธารณะ (รย.17)");


echo "<select name=typecar id=typecar>";
	echo "<option value=\"\">----------เลือก----------</option>";
	for($i=0;$i<count($type);$i++){
		$chk="";
		if($typecar==$type[$i]){
			$chk="selected";
		}
		echo "<option value=\"$type[$i]\" $chk>$type[$i]</option>";
	}
echo "</select>";
?>